services/skus/testdata/stripe_invoice_paid.json

{
    "id": "evt_1PZ6NaBSm1mtrN9nAQykRYwm",
    "object": "event",
    "api_version": "2020-03-02",
    "created": 1720163784,
    "data": {
        "object": {
            "id": "in_1PZ6NUBSm1mtrN9n7GFLtsrN",
            "object": "invoice",
            "account_country": "US",
            "account_name": "Brave Software, Inc.",
            "account_tax_ids": null,
            "amount_due": 0,
            "amount_paid": 0,
            "amount_remaining": 0,
            "amount_shipping": 0,
            "application": null,
            "application_fee_amount": null,
            "attempt_count": 0,
            "attempted": true,
            "auto_advance": false,
            "automatic_tax": {
                "enabled": false,
                "liability": null,
                "status": null
            },
            "billing_reason": "subscription_create",
            "charge": null,
            "collection_method": "charge_automatically",
            "created": 1720163780,
            "currency": "usd",
            "custom_fields": null,
            "customer": "cus_QPwFwyINLgIcPd",
            "customer_address": {
                "city": null,
                "country": "AU",
                "line1": null,
                "line2": null,
                "postal_code": null,
                "state": null
            },
            "customer_email": "facade00-0000-4000-a000-000000000000@mailinator.com",
            "customer_name": "69",
            "customer_phone": null,
            "customer_shipping": null,
            "customer_tax_exempt": "none",
            "customer_tax_ids": [],
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "discounts": [],
            "due_date": null,
            "effective_at": 1720163780,
            "ending_balance": 0,
            "footer": "Brave Premium products are paid services and at your sole discretion, you can pay to subscribe to any or all of them. They include Brave Leo, Brave Firewall + VPN, Brave Talk Premium, and Brave Search Premium.\n\nPaid subscriptions automatically renew until canceled on the Account Site at https://account.brave.com/. Subscriptions can be canceled at any time unless specified otherwise. You can find more information on the Brave Help Center, including how to cancel subscriptions to Brave Premium products and services: https://support.brave.com",
            "from_invoice": null,
            "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1G6QBvBSm1mtrN9n/test_YWNjdF8xRzZRQnZCU20xbXRyTjluLF9RUHdHN3pYd2h5SG9vcnBDajhIdVpmSjBHYXBycmxVLDExMDcwNDU4Ng0200MxEBeWj6?s=ap",
            "invoice_pdf": "https://pay.stripe.com/invoice/acct_1G6QBvBSm1mtrN9n/test_YWNjdF8xRzZRQnZCU20xbXRyTjluLF9RUHdHN3pYd2h5SG9vcnBDajhIdVpmSjBHYXBycmxVLDExMDcwNDU4Ng0200MxEBeWj6/pdf?s=ap",
            "issuer": {
                "type": "self"
            },
            "last_finalization_error": null,
            "latest_revision": null,
            "lines": {
                "object": "list",
                "data": [
                    {
                        "id": "il_1PZ6NUBSm1mtrN9nga12A4jy",
                        "object": "line_item",
                        "amount": 0,
                        "amount_excluding_tax": 0,
                        "currency": "usd",
                        "description": "Trial period for Brave Talk",
                        "discount_amounts": [],
                        "discountable": true,
                        "discounts": [],
                        "invoice": "in_1PZ6NUBSm1mtrN9n7GFLtsrN",
                        "livemode": false,
                        "metadata": {
                            "orderID": "f0eb952b-90df-4fd3-b079-c4ea1effb38d"
                        },
                        "period": {
                            "end": 1720768578,
                            "start": 1720163778
                        },
                        "plan": {
                            "id": "price_1JooWTBSm1mtrN9ng3CpG4m4",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 700,
                            "amount_decimal": "700",
                            "billing_scheme": "per_unit",
                            "created": 1635250377,
                            "currency": "usd",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "meter": null,
                            "nickname": null,
                            "product": "prod_KTm4FtcniuTAOb",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1JooWTBSm1mtrN9ng3CpG4m4",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1635250377,
                            "currency": "usd",
                            "custom_unit_amount": null,
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_KTm4FtcniuTAOb",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "meter": null,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 700,
                            "unit_amount_decimal": "700"
                        },
                        "proration": false,
                        "proration_details": {
                            "credited_items": null
                        },
                        "quantity": 1,
                        "subscription": "sub_1PZ6NTBSm1mtrN9nhOEgB0jm",
                        "subscription_item": "si_QPwFMHw06E9UQl",
                        "tax_amounts": [],
                        "tax_rates": [],
                        "type": "subscription",
                        "unit_amount_excluding_tax": "0"
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/invoices/in_1PZ6NUBSm1mtrN9n7GFLtsrN/lines"
            },
            "livemode": false,
            "metadata": {},
            "next_payment_attempt": null,
            "number": "55E9035F-0001",
            "on_behalf_of": null,
            "paid": true,
            "paid_out_of_band": false,
            "payment_intent": null,
            "payment_settings": {
                "default_mandate": null,
                "payment_method_options": {
                    "acss_debit": null,
                    "bancontact": null,
                    "card": {
                        "request_three_d_secure": "automatic"
                    },
                    "customer_balance": null,
                    "konbini": null,
                    "sepa_debit": null,
                    "us_bank_account": null
                },
                "payment_method_types": null
            },
            "period_end": 1720163778,
            "period_start": 1720163778,
            "post_payment_credit_notes_amount": 0,
            "pre_payment_credit_notes_amount": 0,
            "quote": null,
            "receipt_number": null,
            "rendering": {
                "amount_tax_display": null,
                "pdf": null
            },
            "rendering_options": null,
            "shipping_cost": null,
            "shipping_details": null,
            "starting_balance": 0,
            "statement_descriptor": null,
            "status": "paid",
            "status_transitions": {
                "finalized_at": 1720163780,
                "marked_uncollectible_at": null,
                "paid_at": 1720163778,
                "voided_at": null
            },
            "subscription": "sub_1PZ6NTBSm1mtrN9nhOEgB0jm",
            "subscription_details": {
                "metadata": {
                    "orderID": "f0eb952b-90df-4fd3-b079-c4ea1effb38d"
                }
            },
            "subtotal": 0,
            "subtotal_excluding_tax": 0,
            "tax": null,
            "tax_percent": null,
            "test_clock": null,
            "total": 0,
            "total_discount_amounts": [],
            "total_excluding_tax": 0,
            "total_tax_amounts": [],
            "transfer_data": null,
            "webhooks_delivered_at": 1720163780
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": null,
        "idempotency_key": null
    },
    "type": "invoice.paid"
}
