services/skus/testdata/stripe_sub_deleted.json

{
    "id": "evt_1PaDa9BSm1mtrN9ntKuZf3bO",
    "object": "event",
    "api_version": "2020-03-02",
    "created": 1720429801,
    "data": {
        "object": {
            "id": "sub_1PZ6NTBSm1mtrN9nhOEgB0jm",
            "object": "subscription",
            "application": null,
            "application_fee_percent": null,
            "automatic_tax": {
                "enabled": false,
                "liability": null
            },
            "billing_cycle_anchor": 1720768578,
            "billing_cycle_anchor_config": null,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": 1720429801,
            "cancellation_details": {
                "comment": null,
                "feedback": null,
                "reason": "cancellation_requested"
            },
            "collection_method": "charge_automatically",
            "created": 1720163778,
            "currency": "usd",
            "current_period_end": 1720768578,
            "current_period_start": 1720163778,
            "customer": "cus_QPwFwyINLgIcPd",
            "days_until_due": null,
            "default_payment_method": "pm_1PZ6NOBSm1mtrN9nPjVkEml6",
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discount": null,
            "discounts": [],
            "ended_at": 1720429801,
            "invoice_settings": {
                "account_tax_ids": null,
                "issuer": {
                    "type": "self"
                }
            },
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_QPwFMHw06E9UQl",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1720163780,
                        "discounts": [],
                        "metadata": {},
                        "plan": {
                            "id": "price_1JooWTBSm1mtrN9ng3CpG4m4",
                            "object": "plan",
                            "active": true,
                            "aggregate_usage": null,
                            "amount": 700,
                            "amount_decimal": "700",
                            "billing_scheme": "per_unit",
                            "created": 1635250377,
                            "currency": "usd",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "meter": null,
                            "nickname": null,
                            "product": "prod_KTm4FtcniuTAOb",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1JooWTBSm1mtrN9ng3CpG4m4",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1635250377,
                            "currency": "usd",
                            "custom_unit_amount": null,
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_KTm4FtcniuTAOb",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "meter": null,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 700,
                            "unit_amount_decimal": "700"
                        },
                        "quantity": 1,
                        "subscription": "sub_1PZ6NTBSm1mtrN9nhOEgB0jm",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/subscription_items?subscription=sub_1PZ6NTBSm1mtrN9nhOEgB0jm"
            },
            "latest_invoice": "in_1PZ6NUBSm1mtrN9n7GFLtsrN",
            "livemode": false,
            "metadata": {
                "orderID": "f0eb952b-90df-4fd3-b079-c4ea1effb38d"
            },
            "next_pending_invoice_item_invoice": null,
            "on_behalf_of": null,
            "pause_collection": null,
            "payment_settings": {
                "payment_method_options": {
                    "acss_debit": null,
                    "bancontact": null,
                    "card": {
                        "network": null,
                        "request_three_d_secure": "automatic"
                    },
                    "customer_balance": null,
                    "konbini": null,
                    "sepa_debit": null,
                    "us_bank_account": null
                },
                "payment_method_types": null,
                "save_default_payment_method": "off"
            },
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "plan": {
                "id": "price_1JooWTBSm1mtrN9ng3CpG4m4",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 700,
                "amount_decimal": "700",
                "billing_scheme": "per_unit",
                "created": 1635250377,
                "currency": "usd",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "meter": null,
                "nickname": null,
                "product": "prod_KTm4FtcniuTAOb",
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 1,
            "schedule": null,
            "start_date": 1720163778,
            "status": "canceled",
            "tax_percent": null,
            "test_clock": null,
            "transfer_data": null,
            "trial_end": 1720768578,
            "trial_settings": {
                "end_behavior": {
                    "missing_payment_method": "create_invoice"
                }
            },
            "trial_start": 1720163778
        }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
        "id": "req_5YXNegiDpL0NML",
        "idempotency_key": null
    },
    "type": "customer.subscription.deleted"
}
